#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.network.data.aws_availability_zones.available: Reading...
module.network.data.aws_region.current: Reading...
module.network.data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.network.data.aws_availability_zones.available: Read complete after 1s [id=eu-central-1]
module.network.data.aws_availability_zone.all[1]: Reading...
module.network.data.aws_availability_zone.all[2]: Reading...
module.network.data.aws_availability_zone.all[0]: Reading...
module.network.data.aws_availability_zone.all[2]: Read complete after 0s [id=eu-central-1c]
module.network.data.aws_availability_zone.all[1]: Read complete after 0s [id=eu-central-1b]
module.network.data.aws_availability_zone.all[0]: Read complete after 0s [id=eu-central-1a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.network.aws_egress_only_internet_gateway.ipv6[0] will be created
  + resource "aws_egress_only_internet_gateway" "ipv6" {
      + id       = (known after apply)
      + tags_all = (known after apply)
      + vpc_id   = (known after apply)
    }

  # module.network.aws_eip.eip[0] will be created
  + resource "aws_eip" "eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Access"                          = "private"
          + "deleteme"                        = "true"
          + "karpenter.sh/discovery"          = "stackx"
          + "kubernetes.io/cluster/stackx"    = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "managedby"                       = "terratest"
          + "owner"                           = "terraform-aws-terratest"
          + "project"                         = "stackx"
          + "test"                            = "true"
          + "workspace"                       = "terratest"
        }
      + tags_all             = {
          + "Access"                          = "private"
          + "deleteme"                        = "true"
          + "karpenter.sh/discovery"          = "stackx"
          + "kubernetes.io/cluster/stackx"    = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "managedby"                       = "terratest"
          + "owner"                           = "terraform-aws-terratest"
          + "project"                         = "stackx"
          + "test"                            = "true"
          + "workspace"                       = "terratest"
        }
      + vpc                  = (known after apply)
    }

  # module.network.aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Github"   = "https://github.com/ventx/terraform-aws-stackx-network"
          + "Module"   = "terraform-aws-stackx-network"
          + "Name"     = "stackx-0-network"
          + "deleteme" = "true"
          + "test"     = "true"
        }
      + tags_all = {
          + "Github"   = "https://github.com/ventx/terraform-aws-stackx-network"
          + "Module"   = "terraform-aws-stackx-network"
          + "Name"     = "stackx-0-network"
          + "deleteme" = "true"
          + "test"     = "true"
        }
      + vpc_id   = (known after apply)
    }

  # module.network.aws_nat_gateway.natgw[0] will be created
  + resource "aws_nat_gateway" "natgw" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Access"                          = "private"
          + "deleteme"                        = "true"
          + "karpenter.sh/discovery"          = "stackx"
          + "kubernetes.io/cluster/stackx"    = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "managedby"                       = "terratest"
          + "owner"                           = "terraform-aws-terratest"
          + "project"                         = "stackx"
          + "test"                            = "true"
          + "workspace"                       = "terratest"
        }
      + tags_all                           = {
          + "Access"                          = "private"
          + "deleteme"                        = "true"
          + "karpenter.sh/discovery"          = "stackx"
          + "kubernetes.io/cluster/stackx"    = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "managedby"                       = "terratest"
          + "owner"                           = "terraform-aws-terratest"
          + "project"                         = "stackx"
          + "test"                            = "true"
          + "workspace"                       = "terratest"
        }
    }

  # module.network.aws_route.private_ipv6_egress["a"] will be created
  + resource "aws_route" "private_ipv6_egress" {
      + destination_ipv6_cidr_block = "::/0"
      + egress_only_gateway_id      = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.network.aws_route.private_ipv6_egress["b"] will be created
  + resource "aws_route" "private_ipv6_egress" {
      + destination_ipv6_cidr_block = "::/0"
      + egress_only_gateway_id      = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.network.aws_route.private_ipv6_egress["c"] will be created
  + resource "aws_route" "private_ipv6_egress" {
      + destination_ipv6_cidr_block = "::/0"
      + egress_only_gateway_id      = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.network.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.network.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.network.aws_route.public_internet_gateway_ipv6["a"] will be created
  + resource "aws_route" "public_internet_gateway_ipv6" {
      + destination_ipv6_cidr_block = "::/0"
      + egress_only_gateway_id      = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.network.aws_route.public_internet_gateway_ipv6["b"] will be created
  + resource "aws_route" "public_internet_gateway_ipv6" {
      + destination_ipv6_cidr_block = "::/0"
      + egress_only_gateway_id      = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.network.aws_route.public_internet_gateway_ipv6["c"] will be created
  + resource "aws_route" "public_internet_gateway_ipv6" {
      + destination_ipv6_cidr_block = "::/0"
      + egress_only_gateway_id      = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.network.aws_route_table.private["a"] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Access"                          = "private"
          + "deleteme"                        = "true"
          + "karpenter.sh/discovery"          = "stackx"
          + "kubernetes.io/cluster/stackx"    = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "managedby"                       = "terratest"
          + "owner"                           = "terraform-aws-terratest"
          + "project"                         = "stackx"
          + "test"                            = "true"
          + "workspace"                       = "terratest"
        }
      + tags_all         = {
          + "Access"                          = "private"
          + "deleteme"                        = "true"
          + "karpenter.sh/discovery"          = "stackx"
          + "kubernetes.io/cluster/stackx"    = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "managedby"                       = "terratest"
          + "owner"                           = "terraform-aws-terratest"
          + "project"                         = "stackx"
          + "test"                            = "true"
          + "workspace"                       = "terratest"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.aws_route_table.private["b"] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Access"                          = "private"
          + "deleteme"                        = "true"
          + "karpenter.sh/discovery"          = "stackx"
          + "kubernetes.io/cluster/stackx"    = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "managedby"                       = "terratest"
          + "owner"                           = "terraform-aws-terratest"
          + "project"                         = "stackx"
          + "test"                            = "true"
          + "workspace"                       = "terratest"
        }
      + tags_all         = {
          + "Access"                          = "private"
          + "deleteme"                        = "true"
          + "karpenter.sh/discovery"          = "stackx"
          + "kubernetes.io/cluster/stackx"    = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "managedby"                       = "terratest"
          + "owner"                           = "terraform-aws-terratest"
          + "project"                         = "stackx"
          + "test"                            = "true"
          + "workspace"                       = "terratest"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.aws_route_table.private["c"] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Access"                          = "private"
          + "deleteme"                        = "true"
          + "karpenter.sh/discovery"          = "stackx"
          + "kubernetes.io/cluster/stackx"    = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "managedby"                       = "terratest"
          + "owner"                           = "terraform-aws-terratest"
          + "project"                         = "stackx"
          + "test"                            = "true"
          + "workspace"                       = "terratest"
        }
      + tags_all         = {
          + "Access"                          = "private"
          + "deleteme"                        = "true"
          + "karpenter.sh/discovery"          = "stackx"
          + "kubernetes.io/cluster/stackx"    = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "managedby"                       = "terratest"
          + "owner"                           = "terraform-aws-terratest"
          + "project"                         = "stackx"
          + "test"                            = "true"
          + "workspace"                       = "terratest"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Access"                       = "public"
          + "deleteme"                     = "true"
          + "kubernetes.io/cluster/stackx" = "shared"
          + "kubernetes.io/role/elb"       = "1"
          + "managedby"                    = "terratest"
          + "owner"                        = "terraform-aws-terratest"
          + "project"                      = "stackx"
          + "test"                         = "true"
          + "workspace"                    = "terratest"
        }
      + tags_all         = {
          + "Access"                       = "public"
          + "deleteme"                     = "true"
          + "kubernetes.io/cluster/stackx" = "shared"
          + "kubernetes.io/role/elb"       = "1"
          + "managedby"                    = "terratest"
          + "owner"                        = "terraform-aws-terratest"
          + "project"                      = "stackx"
          + "test"                         = "true"
          + "workspace"                    = "terratest"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.aws_route_table_association.private["a"] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.private["b"] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.private["c"] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.public["a"] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.public["b"] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.public["c"] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_subnet.private["a"] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.0.0/18"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Access"                          = "private"
          + "Name"                            = "private-eu-central-1a"
          + "deleteme"                        = "true"
          + "karpenter.sh/discovery"          = "stackx"
          + "kubernetes.io/cluster/stackx"    = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "managedby"                       = "terratest"
          + "owner"                           = "terraform-aws-terratest"
          + "project"                         = "stackx"
          + "test"                            = "true"
          + "workspace"                       = "terratest"
        }
      + tags_all                                       = {
          + "Access"                          = "private"
          + "Name"                            = "private-eu-central-1a"
          + "deleteme"                        = "true"
          + "karpenter.sh/discovery"          = "stackx"
          + "kubernetes.io/cluster/stackx"    = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "managedby"                       = "terratest"
          + "owner"                           = "terraform-aws-terratest"
          + "project"                         = "stackx"
          + "test"                            = "true"
          + "workspace"                       = "terratest"
        }
      + vpc_id                                         = (known after apply)

      + timeouts {
          + delete = "30m"
        }
    }

  # module.network.aws_subnet.private["b"] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.64.0/18"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Access"                          = "private"
          + "Name"                            = "private-eu-central-1b"
          + "deleteme"                        = "true"
          + "karpenter.sh/discovery"          = "stackx"
          + "kubernetes.io/cluster/stackx"    = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "managedby"                       = "terratest"
          + "owner"                           = "terraform-aws-terratest"
          + "project"                         = "stackx"
          + "test"                            = "true"
          + "workspace"                       = "terratest"
        }
      + tags_all                                       = {
          + "Access"                          = "private"
          + "Name"                            = "private-eu-central-1b"
          + "deleteme"                        = "true"
          + "karpenter.sh/discovery"          = "stackx"
          + "kubernetes.io/cluster/stackx"    = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "managedby"                       = "terratest"
          + "owner"                           = "terraform-aws-terratest"
          + "project"                         = "stackx"
          + "test"                            = "true"
          + "workspace"                       = "terratest"
        }
      + vpc_id                                         = (known after apply)

      + timeouts {
          + delete = "30m"
        }
    }

  # module.network.aws_subnet.private["c"] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.128.0/18"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Access"                          = "private"
          + "Name"                            = "private-eu-central-1c"
          + "deleteme"                        = "true"
          + "karpenter.sh/discovery"          = "stackx"
          + "kubernetes.io/cluster/stackx"    = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "managedby"                       = "terratest"
          + "owner"                           = "terraform-aws-terratest"
          + "project"                         = "stackx"
          + "test"                            = "true"
          + "workspace"                       = "terratest"
        }
      + tags_all                                       = {
          + "Access"                          = "private"
          + "Name"                            = "private-eu-central-1c"
          + "deleteme"                        = "true"
          + "karpenter.sh/discovery"          = "stackx"
          + "kubernetes.io/cluster/stackx"    = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "managedby"                       = "terratest"
          + "owner"                           = "terraform-aws-terratest"
          + "project"                         = "stackx"
          + "test"                            = "true"
          + "workspace"                       = "terratest"
        }
      + vpc_id                                         = (known after apply)

      + timeouts {
          + delete = "30m"
        }
    }

  # module.network.aws_subnet.public["a"] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.192.0/22"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Access"                       = "public"
          + "Name"                         = "public-eu-central-1a"
          + "deleteme"                     = "true"
          + "kubernetes.io/cluster/stackx" = "shared"
          + "kubernetes.io/role/elb"       = "1"
          + "managedby"                    = "terratest"
          + "owner"                        = "terraform-aws-terratest"
          + "project"                      = "stackx"
          + "test"                         = "true"
          + "workspace"                    = "terratest"
        }
      + tags_all                                       = {
          + "Access"                       = "public"
          + "Name"                         = "public-eu-central-1a"
          + "deleteme"                     = "true"
          + "kubernetes.io/cluster/stackx" = "shared"
          + "kubernetes.io/role/elb"       = "1"
          + "managedby"                    = "terratest"
          + "owner"                        = "terraform-aws-terratest"
          + "project"                      = "stackx"
          + "test"                         = "true"
          + "workspace"                    = "terratest"
        }
      + vpc_id                                         = (known after apply)

      + timeouts {
          + delete = "30m"
        }
    }

  # module.network.aws_subnet.public["b"] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.196.0/22"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Access"                       = "public"
          + "Name"                         = "public-eu-central-1b"
          + "deleteme"                     = "true"
          + "kubernetes.io/cluster/stackx" = "shared"
          + "kubernetes.io/role/elb"       = "1"
          + "managedby"                    = "terratest"
          + "owner"                        = "terraform-aws-terratest"
          + "project"                      = "stackx"
          + "test"                         = "true"
          + "workspace"                    = "terratest"
        }
      + tags_all                                       = {
          + "Access"                       = "public"
          + "Name"                         = "public-eu-central-1b"
          + "deleteme"                     = "true"
          + "kubernetes.io/cluster/stackx" = "shared"
          + "kubernetes.io/role/elb"       = "1"
          + "managedby"                    = "terratest"
          + "owner"                        = "terraform-aws-terratest"
          + "project"                      = "stackx"
          + "test"                         = "true"
          + "workspace"                    = "terratest"
        }
      + vpc_id                                         = (known after apply)

      + timeouts {
          + delete = "30m"
        }
    }

  # module.network.aws_subnet.public["c"] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.200.0/22"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Access"                       = "public"
          + "Name"                         = "public-eu-central-1c"
          + "deleteme"                     = "true"
          + "kubernetes.io/cluster/stackx" = "shared"
          + "kubernetes.io/role/elb"       = "1"
          + "managedby"                    = "terratest"
          + "owner"                        = "terraform-aws-terratest"
          + "project"                      = "stackx"
          + "test"                         = "true"
          + "workspace"                    = "terratest"
        }
      + tags_all                                       = {
          + "Access"                       = "public"
          + "Name"                         = "public-eu-central-1c"
          + "deleteme"                     = "true"
          + "kubernetes.io/cluster/stackx" = "shared"
          + "kubernetes.io/role/elb"       = "1"
          + "managedby"                    = "terratest"
          + "owner"                        = "terraform-aws-terratest"
          + "project"                      = "stackx"
          + "test"                         = "true"
          + "workspace"                    = "terratest"
        }
      + vpc_id                                         = (known after apply)

      + timeouts {
          + delete = "30m"
        }
    }

  # module.network.aws_vpc.vpc will be created
  + resource "aws_vpc" "vpc" {
      + arn                                  = (known after apply)
      + assign_generated_ipv6_cidr_block     = true
      + cidr_block                           = "10.1.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Github"   = "https://github.com/ventx/terraform-aws-stackx-network"
          + "Module"   = "terraform-aws-stackx-network"
          + "Name"     = "stackx-0-network"
          + "deleteme" = "true"
          + "test"     = "true"
        }
      + tags_all                             = {
          + "Github"   = "https://github.com/ventx/terraform-aws-stackx-network"
          + "Module"   = "terraform-aws-stackx-network"
          + "Name"     = "stackx-0-network"
          + "deleteme" = "true"
          + "test"     = "true"
        }
    }

  # module.network.aws_vpc_endpoint.s3[0] will be created
  + resource "aws_vpc_endpoint" "s3" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.eu-central-1.s3"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Github"   = "https://github.com/ventx/terraform-aws-stackx-network"
          + "Module"   = "terraform-aws-stackx-network"
          + "Name"     = "stackx-0-network-s3"
          + "deleteme" = "true"
          + "test"     = "true"
        }
      + tags_all              = {
          + "Github"   = "https://github.com/ventx/terraform-aws-stackx-network"
          + "Module"   = "terraform-aws-stackx-network"
          + "Name"     = "stackx-0-network-s3"
          + "deleteme" = "true"
          + "test"     = "true"
        }
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)
    }

  # module.network.aws_vpc_endpoint_route_table_association.private_s3[0] will be created
  + resource "aws_vpc_endpoint_route_table_association" "private_s3" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.network.aws_vpc_endpoint_route_table_association.private_s3[1] will be created
  + resource "aws_vpc_endpoint_route_table_association" "private_s3" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.network.aws_vpc_endpoint_route_table_association.private_s3[2] will be created
  + resource "aws_vpc_endpoint_route_table_association" "private_s3" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

Plan: 33 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + private_subnet_ids = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + public_subnet_ids  = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + vpc_id             = (known after apply)
  + zones              = 3

```

</details>

*Pushed by: @hajowieland, Action: `pull_request`*